       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUEVO-SUB.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
                  DECIMAL-POINT IS COMMA.
      *            CARACTERES CHAR
                  SYMBOLIC CHARACTERS ESPACIO IS 33.
                  SYMBOLIC CHARACTERS LETRA-A IS 66.
                  SYMBOLIC CHARACTERS DERECHA ARE 176
                                       IZQUIERDA 175.
                  SYMBOLIC CHARACTERS MEDIO CUARTO TRES-CUARTOS
                                  ARE  172    173      244.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY ESPACIO.
            DISPLAY IZQUIERDA ESPACIO LETRA-A
               ESPACIO DERECHA.
            DISPLAY MEDIO.
            DISPLAY CUARTO.
            DISPLAY TRES-CUARTOS.
            STOP RUN.
       END PROGRAM NUEVO-SUB.
