       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUEVO-SUB.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
                  DECIMAL-POINT IS COMMA.
      *            CARACTERES CHAR
                  SYMBOLIC CHARACTERS ESPACIO IS 33.
                  SYMBOLIC CHARACTERS LETRA-A IS 66.
                  SYMBOLIC CHARACTERS DERECHA IS 176.
                  SYMBOLIC CHARACTERS IZQUIERDA IS 175.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY ESPACIO.
            DISPLAY IZQUIERDA ESPACIO LETRA-A
               ESPACIO DERECHA.
            STOP RUN.
       END PROGRAM NUEVO-SUB.
